dunknowcoding/NiusBurner/niusburner/arduino/pic24/boards.txt
# NiusBurner pic24 boards.
#
# Copyright 2026 dunknowcoding (NiusRobotLab)
# SPDX-License-Identifier: Apache-2.0
#
# Generated from niusburner/boards.json by `python -m niusburner setup`.
# Edit the catalog, not this file.
#
# Defaults are the safe answer, not the fastest one: Size, because
# these parts run out of room long before cycles;
# because symbols cost build time and disk rather than flash; and
# auto-detection, because a compiler is normally where its own
# installer put it.

menu.optimize=Optimize
menu.compiler=Compiler
menu.fcpu=Clock

# ----------------------------------------------------------------------
# 7 KB flash, 512 B RAM, 28-pin. 16-bit core, PICkit 3 over ICSP. Ports BCDEF. UART1 on fixed pins.
dspic30f2010.name=dsPIC30F series - 30F2010 (7 KB, PICkit 3) [experimental]
dspic30f2010.upload.tool=niusburner
dspic30f2010.upload.protocol=pickit3
dspic30f2010.upload.maximum_size=7936
dspic30f2010.upload.maximum_data_size=512
dspic30f2010.upload.require_upload_port=false
dspic30f2010.build.mcu=30F2010
dspic30f2010.build.f_cpu=7372800L
dspic30f2010.build.board=30F2010
dspic30f2010.build.core=niusburner
dspic30f2010.build.variant=standard
dspic30f2010.build.nb_board=dspic30f2010
dspic30f2010.build.extra_flags=

dspic30f2010.menu.optimize.size=Size (default)
dspic30f2010.menu.optimize.size.build.nb_optimize=size
dspic30f2010.menu.optimize.speed=Speed
dspic30f2010.menu.optimize.speed.build.nb_optimize=speed
dspic30f2010.menu.optimize.none=None
dspic30f2010.menu.optimize.none.build.nb_optimize=none

dspic30f2010.menu.compiler.auto=Auto-detect SDCC (default)
dspic30f2010.menu.compiler.auto.build.nb_compiler=auto
dspic30f2010.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
dspic30f2010.menu.compiler.configured.build.nb_compiler=configured

dspic30f2010.menu.fcpu.board=As the board says (default)
dspic30f2010.menu.fcpu.board.build.nb_fcpu=board
dspic30f2010.menu.fcpu.4000000=4 MHz
dspic30f2010.menu.fcpu.4000000.build.nb_fcpu=4000000
dspic30f2010.menu.fcpu.8000000=8 MHz
dspic30f2010.menu.fcpu.8000000.build.nb_fcpu=8000000
dspic30f2010.menu.fcpu.11059200=11.0592 MHz
dspic30f2010.menu.fcpu.11059200.build.nb_fcpu=11059200
dspic30f2010.menu.fcpu.12000000=12 MHz
dspic30f2010.menu.fcpu.12000000.build.nb_fcpu=12000000
dspic30f2010.menu.fcpu.16000000=16 MHz
dspic30f2010.menu.fcpu.16000000.build.nb_fcpu=16000000
dspic30f2010.menu.fcpu.20000000=20 MHz
dspic30f2010.menu.fcpu.20000000.build.nb_fcpu=20000000
dspic30f2010.menu.fcpu.22118400=22.1184 MHz
dspic30f2010.menu.fcpu.22118400.build.nb_fcpu=22118400
dspic30f2010.menu.fcpu.24000000=24 MHz
dspic30f2010.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 7 KB flash, 1024 B RAM, 28-pin. 16-bit core, PICkit 3 over ICSP. Ports BCD. UART1 on fixed pins.
dspic30f2011.name=dsPIC30F series - 30F2011 (7 KB, PICkit 3) [experimental]
dspic30f2011.upload.tool=niusburner
dspic30f2011.upload.protocol=pickit3
dspic30f2011.upload.maximum_size=7936
dspic30f2011.upload.maximum_data_size=1024
dspic30f2011.upload.require_upload_port=false
dspic30f2011.build.mcu=30F2011
dspic30f2011.build.f_cpu=7372800L
dspic30f2011.build.board=30F2011
dspic30f2011.build.core=niusburner
dspic30f2011.build.variant=standard
dspic30f2011.build.nb_board=dspic30f2011
dspic30f2011.build.extra_flags=

dspic30f2011.menu.optimize.size=Size (default)
dspic30f2011.menu.optimize.size.build.nb_optimize=size
dspic30f2011.menu.optimize.speed=Speed
dspic30f2011.menu.optimize.speed.build.nb_optimize=speed
dspic30f2011.menu.optimize.none=None
dspic30f2011.menu.optimize.none.build.nb_optimize=none

dspic30f2011.menu.compiler.auto=Auto-detect SDCC (default)
dspic30f2011.menu.compiler.auto.build.nb_compiler=auto
dspic30f2011.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
dspic30f2011.menu.compiler.configured.build.nb_compiler=configured

dspic30f2011.menu.fcpu.board=As the board says (default)
dspic30f2011.menu.fcpu.board.build.nb_fcpu=board
dspic30f2011.menu.fcpu.4000000=4 MHz
dspic30f2011.menu.fcpu.4000000.build.nb_fcpu=4000000
dspic30f2011.menu.fcpu.8000000=8 MHz
dspic30f2011.menu.fcpu.8000000.build.nb_fcpu=8000000
dspic30f2011.menu.fcpu.11059200=11.0592 MHz
dspic30f2011.menu.fcpu.11059200.build.nb_fcpu=11059200
dspic30f2011.menu.fcpu.12000000=12 MHz
dspic30f2011.menu.fcpu.12000000.build.nb_fcpu=12000000
dspic30f2011.menu.fcpu.16000000=16 MHz
dspic30f2011.menu.fcpu.16000000.build.nb_fcpu=16000000
dspic30f2011.menu.fcpu.20000000=20 MHz
dspic30f2011.menu.fcpu.20000000.build.nb_fcpu=20000000
dspic30f2011.menu.fcpu.22118400=22.1184 MHz
dspic30f2011.menu.fcpu.22118400.build.nb_fcpu=22118400
dspic30f2011.menu.fcpu.24000000=24 MHz
dspic30f2011.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 7 KB flash, 1024 B RAM, 28-pin. 16-bit core, PICkit 3 over ICSP. Ports BCDF. UART1 on fixed pins.
dspic30f2012.name=dsPIC30F series - 30F2012 (7 KB, PICkit 3) [experimental]
dspic30f2012.upload.tool=niusburner
dspic30f2012.upload.protocol=pickit3
dspic30f2012.upload.maximum_size=7936
dspic30f2012.upload.maximum_data_size=1024
dspic30f2012.upload.require_upload_port=false
dspic30f2012.build.mcu=30F2012
dspic30f2012.build.f_cpu=7372800L
dspic30f2012.build.board=30F2012
dspic30f2012.build.core=niusburner
dspic30f2012.build.variant=standard
dspic30f2012.build.nb_board=dspic30f2012
dspic30f2012.build.extra_flags=

dspic30f2012.menu.optimize.size=Size (default)
dspic30f2012.menu.optimize.size.build.nb_optimize=size
dspic30f2012.menu.optimize.speed=Speed
dspic30f2012.menu.optimize.speed.build.nb_optimize=speed
dspic30f2012.menu.optimize.none=None
dspic30f2012.menu.optimize.none.build.nb_optimize=none

dspic30f2012.menu.compiler.auto=Auto-detect SDCC (default)
dspic30f2012.menu.compiler.auto.build.nb_compiler=auto
dspic30f2012.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
dspic30f2012.menu.compiler.configured.build.nb_compiler=configured

dspic30f2012.menu.fcpu.board=As the board says (default)
dspic30f2012.menu.fcpu.board.build.nb_fcpu=board
dspic30f2012.menu.fcpu.4000000=4 MHz
dspic30f2012.menu.fcpu.4000000.build.nb_fcpu=4000000
dspic30f2012.menu.fcpu.8000000=8 MHz
dspic30f2012.menu.fcpu.8000000.build.nb_fcpu=8000000
dspic30f2012.menu.fcpu.11059200=11.0592 MHz
dspic30f2012.menu.fcpu.11059200.build.nb_fcpu=11059200
dspic30f2012.menu.fcpu.12000000=12 MHz
dspic30f2012.menu.fcpu.12000000.build.nb_fcpu=12000000
dspic30f2012.menu.fcpu.16000000=16 MHz
dspic30f2012.menu.fcpu.16000000.build.nb_fcpu=16000000
dspic30f2012.menu.fcpu.20000000=20 MHz
dspic30f2012.menu.fcpu.20000000.build.nb_fcpu=20000000
dspic30f2012.menu.fcpu.22118400=22.1184 MHz
dspic30f2012.menu.fcpu.22118400.build.nb_fcpu=22118400
dspic30f2012.menu.fcpu.24000000=24 MHz
dspic30f2012.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 15 KB flash, 2048 B RAM, 28-pin. 16-bit core, PICkit 3 over ICSP. Ports BCD. UART1 on fixed pins.
dspic30f3012.name=dsPIC30F series - 30F3012 (15 KB, PICkit 3) [experimental]
dspic30f3012.upload.tool=niusburner
dspic30f3012.upload.protocol=pickit3
dspic30f3012.upload.maximum_size=16128
dspic30f3012.upload.maximum_data_size=2048
dspic30f3012.upload.require_upload_port=false
dspic30f3012.build.mcu=30F3012
dspic30f3012.build.f_cpu=7372800L
dspic30f3012.build.board=30F3012
dspic30f3012.build.core=niusburner
dspic30f3012.build.variant=standard
dspic30f3012.build.nb_board=dspic30f3012
dspic30f3012.build.extra_flags=

