dunknowcoding/NiusBurner/niusburner/arduino/pic24/boards.txt
dspic30f3012.menu.optimize.size=Size (default)
dspic30f3012.menu.optimize.size.build.nb_optimize=size
dspic30f3012.menu.optimize.speed=Speed
dspic30f3012.menu.optimize.speed.build.nb_optimize=speed
dspic30f3012.menu.optimize.none=None
dspic30f3012.menu.optimize.none.build.nb_optimize=none

dspic30f3012.menu.compiler.auto=Auto-detect SDCC (default)
dspic30f3012.menu.compiler.auto.build.nb_compiler=auto
dspic30f3012.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
dspic30f3012.menu.compiler.configured.build.nb_compiler=configured

dspic30f3012.menu.fcpu.board=As the board says (default)
dspic30f3012.menu.fcpu.board.build.nb_fcpu=board
dspic30f3012.menu.fcpu.4000000=4 MHz
dspic30f3012.menu.fcpu.4000000.build.nb_fcpu=4000000
dspic30f3012.menu.fcpu.8000000=8 MHz
dspic30f3012.menu.fcpu.8000000.build.nb_fcpu=8000000
dspic30f3012.menu.fcpu.11059200=11.0592 MHz
dspic30f3012.menu.fcpu.11059200.build.nb_fcpu=11059200
dspic30f3012.menu.fcpu.12000000=12 MHz
dspic30f3012.menu.fcpu.12000000.build.nb_fcpu=12000000
dspic30f3012.menu.fcpu.16000000=16 MHz
dspic30f3012.menu.fcpu.16000000.build.nb_fcpu=16000000
dspic30f3012.menu.fcpu.20000000=20 MHz
dspic30f3012.menu.fcpu.20000000.build.nb_fcpu=20000000
dspic30f3012.menu.fcpu.22118400=22.1184 MHz
dspic30f3012.menu.fcpu.22118400.build.nb_fcpu=22118400
dspic30f3012.menu.fcpu.24000000=24 MHz
dspic30f3012.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 15 KB flash, 2048 B RAM, 28-pin. 16-bit core, PICkit 3 over ICSP. Ports BCDF. UART1 on fixed pins.
dspic30f3013.name=dsPIC30F series - 30F3013 (15 KB, PICkit 3) [experimental]
dspic30f3013.upload.tool=niusburner
dspic30f3013.upload.protocol=pickit3
dspic30f3013.upload.maximum_size=16128
dspic30f3013.upload.maximum_data_size=2048
dspic30f3013.upload.require_upload_port=false
dspic30f3013.build.mcu=30F3013
dspic30f3013.build.f_cpu=7372800L
dspic30f3013.build.board=30F3013
dspic30f3013.build.core=niusburner
dspic30f3013.build.variant=standard
dspic30f3013.build.nb_board=dspic30f3013
dspic30f3013.build.extra_flags=

dspic30f3013.menu.optimize.size=Size (default)
dspic30f3013.menu.optimize.size.build.nb_optimize=size
dspic30f3013.menu.optimize.speed=Speed
dspic30f3013.menu.optimize.speed.build.nb_optimize=speed
dspic30f3013.menu.optimize.none=None
dspic30f3013.menu.optimize.none.build.nb_optimize=none

dspic30f3013.menu.compiler.auto=Auto-detect SDCC (default)
dspic30f3013.menu.compiler.auto.build.nb_compiler=auto
dspic30f3013.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
dspic30f3013.menu.compiler.configured.build.nb_compiler=configured

dspic30f3013.menu.fcpu.board=As the board says (default)
dspic30f3013.menu.fcpu.board.build.nb_fcpu=board
dspic30f3013.menu.fcpu.4000000=4 MHz
dspic30f3013.menu.fcpu.4000000.build.nb_fcpu=4000000
dspic30f3013.menu.fcpu.8000000=8 MHz
dspic30f3013.menu.fcpu.8000000.build.nb_fcpu=8000000
dspic30f3013.menu.fcpu.11059200=11.0592 MHz
dspic30f3013.menu.fcpu.11059200.build.nb_fcpu=11059200
dspic30f3013.menu.fcpu.12000000=12 MHz
dspic30f3013.menu.fcpu.12000000.build.nb_fcpu=12000000
dspic30f3013.menu.fcpu.16000000=16 MHz
dspic30f3013.menu.fcpu.16000000.build.nb_fcpu=16000000
dspic30f3013.menu.fcpu.20000000=20 MHz
dspic30f3013.menu.fcpu.20000000.build.nb_fcpu=20000000
dspic30f3013.menu.fcpu.22118400=22.1184 MHz
dspic30f3013.menu.fcpu.22118400.build.nb_fcpu=22118400
dspic30f3013.menu.fcpu.24000000=24 MHz
dspic30f3013.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 15 KB flash, 2048 B RAM, 40-pin. 16-bit core, PICkit 3 over ICSP. Ports ABCDF. UART1 on fixed pins.
dspic30f3014.name=dsPIC30F series - 30F3014 (15 KB, PICkit 3) [experimental]
dspic30f3014.upload.tool=niusburner
dspic30f3014.upload.protocol=pickit3
dspic30f3014.upload.maximum_size=16128
dspic30f3014.upload.maximum_data_size=2048
dspic30f3014.upload.require_upload_port=false
dspic30f3014.build.mcu=30F3014
dspic30f3014.build.f_cpu=7372800L
dspic30f3014.build.board=30F3014
dspic30f3014.build.core=niusburner
dspic30f3014.build.variant=standard
dspic30f3014.build.nb_board=dspic30f3014
dspic30f3014.build.extra_flags=

dspic30f3014.menu.optimize.size=Size (default)
dspic30f3014.menu.optimize.size.build.nb_optimize=size
dspic30f3014.menu.optimize.speed=Speed
dspic30f3014.menu.optimize.speed.build.nb_optimize=speed
dspic30f3014.menu.optimize.none=None
dspic30f3014.menu.optimize.none.build.nb_optimize=none

dspic30f3014.menu.compiler.auto=Auto-detect SDCC (default)
dspic30f3014.menu.compiler.auto.build.nb_compiler=auto
dspic30f3014.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
dspic30f3014.menu.compiler.configured.build.nb_compiler=configured

dspic30f3014.menu.fcpu.board=As the board says (default)
dspic30f3014.menu.fcpu.board.build.nb_fcpu=board
dspic30f3014.menu.fcpu.4000000=4 MHz
dspic30f3014.menu.fcpu.4000000.build.nb_fcpu=4000000
dspic30f3014.menu.fcpu.8000000=8 MHz
dspic30f3014.menu.fcpu.8000000.build.nb_fcpu=8000000
dspic30f3014.menu.fcpu.11059200=11.0592 MHz
dspic30f3014.menu.fcpu.11059200.build.nb_fcpu=11059200
dspic30f3014.menu.fcpu.12000000=12 MHz
dspic30f3014.menu.fcpu.12000000.build.nb_fcpu=12000000
dspic30f3014.menu.fcpu.16000000=16 MHz
dspic30f3014.menu.fcpu.16000000.build.nb_fcpu=16000000
dspic30f3014.menu.fcpu.20000000=20 MHz
dspic30f3014.menu.fcpu.20000000.build.nb_fcpu=20000000
dspic30f3014.menu.fcpu.22118400=22.1184 MHz
dspic30f3014.menu.fcpu.22118400.build.nb_fcpu=22118400
dspic30f3014.menu.fcpu.24000000=24 MHz
dspic30f3014.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 31 KB flash, 2048 B RAM, 40-pin. 16-bit core, PICkit 3 over ICSP. Ports BCDEF. UART1 on fixed pins.
dspic30f4011.name=dsPIC30F series - 30F4011 (31 KB, PICkit 3) [experimental]
dspic30f4011.upload.tool=niusburner
dspic30f4011.upload.protocol=pickit3
dspic30f4011.upload.maximum_size=32512
dspic30f4011.upload.maximum_data_size=2048
dspic30f4011.upload.require_upload_port=false
dspic30f4011.build.mcu=30F4011
dspic30f4011.build.f_cpu=7372800L
dspic30f4011.build.board=30F4011
dspic30f4011.build.core=niusburner
dspic30f4011.build.variant=standard
dspic30f4011.build.nb_board=dspic30f4011
dspic30f4011.build.extra_flags=

dspic30f4011.menu.optimize.size=Size (default)
dspic30f4011.menu.optimize.size.build.nb_optimize=size
dspic30f4011.menu.optimize.speed=Speed
dspic30f4011.menu.optimize.speed.build.nb_optimize=speed
dspic30f4011.menu.optimize.none=None
dspic30f4011.menu.optimize.none.build.nb_optimize=none

dspic30f4011.menu.compiler.auto=Auto-detect SDCC (default)
dspic30f4011.menu.compiler.auto.build.nb_compiler=auto
dspic30f4011.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
dspic30f4011.menu.compiler.configured.build.nb_compiler=configured

