dunknowcoding/NiusBurner/niusburner/arduino/pic24/boards.txt
dspic30f4011.menu.fcpu.board=As the board says (default)
dspic30f4011.menu.fcpu.board.build.nb_fcpu=board
dspic30f4011.menu.fcpu.4000000=4 MHz
dspic30f4011.menu.fcpu.4000000.build.nb_fcpu=4000000
dspic30f4011.menu.fcpu.8000000=8 MHz
dspic30f4011.menu.fcpu.8000000.build.nb_fcpu=8000000
dspic30f4011.menu.fcpu.11059200=11.0592 MHz
dspic30f4011.menu.fcpu.11059200.build.nb_fcpu=11059200
dspic30f4011.menu.fcpu.12000000=12 MHz
dspic30f4011.menu.fcpu.12000000.build.nb_fcpu=12000000
dspic30f4011.menu.fcpu.16000000=16 MHz
dspic30f4011.menu.fcpu.16000000.build.nb_fcpu=16000000
dspic30f4011.menu.fcpu.20000000=20 MHz
dspic30f4011.menu.fcpu.20000000.build.nb_fcpu=20000000
dspic30f4011.menu.fcpu.22118400=22.1184 MHz
dspic30f4011.menu.fcpu.22118400.build.nb_fcpu=22118400
dspic30f4011.menu.fcpu.24000000=24 MHz
dspic30f4011.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 31 KB flash, 2048 B RAM, 28-pin. 16-bit core, PICkit 3 over ICSP. Ports BCDEF. UART1 on fixed pins.
dspic30f4012.name=dsPIC30F series - 30F4012 (31 KB, PICkit 3) [experimental]
dspic30f4012.upload.tool=niusburner
dspic30f4012.upload.protocol=pickit3
dspic30f4012.upload.maximum_size=32512
dspic30f4012.upload.maximum_data_size=2048
dspic30f4012.upload.require_upload_port=false
dspic30f4012.build.mcu=30F4012
dspic30f4012.build.f_cpu=7372800L
dspic30f4012.build.board=30F4012
dspic30f4012.build.core=niusburner
dspic30f4012.build.variant=standard
dspic30f4012.build.nb_board=dspic30f4012
dspic30f4012.build.extra_flags=

dspic30f4012.menu.optimize.size=Size (default)
dspic30f4012.menu.optimize.size.build.nb_optimize=size
dspic30f4012.menu.optimize.speed=Speed
dspic30f4012.menu.optimize.speed.build.nb_optimize=speed
dspic30f4012.menu.optimize.none=None
dspic30f4012.menu.optimize.none.build.nb_optimize=none

dspic30f4012.menu.compiler.auto=Auto-detect SDCC (default)
dspic30f4012.menu.compiler.auto.build.nb_compiler=auto
dspic30f4012.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
dspic30f4012.menu.compiler.configured.build.nb_compiler=configured

dspic30f4012.menu.fcpu.board=As the board says (default)
dspic30f4012.menu.fcpu.board.build.nb_fcpu=board
dspic30f4012.menu.fcpu.4000000=4 MHz
dspic30f4012.menu.fcpu.4000000.build.nb_fcpu=4000000
dspic30f4012.menu.fcpu.8000000=8 MHz
dspic30f4012.menu.fcpu.8000000.build.nb_fcpu=8000000
dspic30f4012.menu.fcpu.11059200=11.0592 MHz
dspic30f4012.menu.fcpu.11059200.build.nb_fcpu=11059200
dspic30f4012.menu.fcpu.12000000=12 MHz
dspic30f4012.menu.fcpu.12000000.build.nb_fcpu=12000000
dspic30f4012.menu.fcpu.16000000=16 MHz
dspic30f4012.menu.fcpu.16000000.build.nb_fcpu=16000000
dspic30f4012.menu.fcpu.20000000=20 MHz
dspic30f4012.menu.fcpu.20000000.build.nb_fcpu=20000000
dspic30f4012.menu.fcpu.22118400=22.1184 MHz
dspic30f4012.menu.fcpu.22118400.build.nb_fcpu=22118400
dspic30f4012.menu.fcpu.24000000=24 MHz
dspic30f4012.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 31 KB flash, 2048 B RAM, 40-pin. 16-bit core, PICkit 3 over ICSP. Ports ABCDF. UART1 on fixed pins.
dspic30f4013.name=dsPIC30F series - 30F4013 (31 KB, PICkit 3) [experimental]
dspic30f4013.upload.tool=niusburner
dspic30f4013.upload.protocol=pickit3
dspic30f4013.upload.maximum_size=32512
dspic30f4013.upload.maximum_data_size=2048
dspic30f4013.upload.require_upload_port=false
dspic30f4013.build.mcu=30F4013
dspic30f4013.build.f_cpu=7372800L
dspic30f4013.build.board=30F4013
dspic30f4013.build.core=niusburner
dspic30f4013.build.variant=standard
dspic30f4013.build.nb_board=dspic30f4013
dspic30f4013.build.extra_flags=

dspic30f4013.menu.optimize.size=Size (default)
dspic30f4013.menu.optimize.size.build.nb_optimize=size
dspic30f4013.menu.optimize.speed=Speed
dspic30f4013.menu.optimize.speed.build.nb_optimize=speed
dspic30f4013.menu.optimize.none=None
dspic30f4013.menu.optimize.none.build.nb_optimize=none

dspic30f4013.menu.compiler.auto=Auto-detect SDCC (default)
dspic30f4013.menu.compiler.auto.build.nb_compiler=auto
dspic30f4013.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
dspic30f4013.menu.compiler.configured.build.nb_compiler=configured

dspic30f4013.menu.fcpu.board=As the board says (default)
dspic30f4013.menu.fcpu.board.build.nb_fcpu=board
dspic30f4013.menu.fcpu.4000000=4 MHz
dspic30f4013.menu.fcpu.4000000.build.nb_fcpu=4000000
dspic30f4013.menu.fcpu.8000000=8 MHz
dspic30f4013.menu.fcpu.8000000.build.nb_fcpu=8000000
dspic30f4013.menu.fcpu.11059200=11.0592 MHz
dspic30f4013.menu.fcpu.11059200.build.nb_fcpu=11059200
dspic30f4013.menu.fcpu.12000000=12 MHz
dspic30f4013.menu.fcpu.12000000.build.nb_fcpu=12000000
dspic30f4013.menu.fcpu.16000000=16 MHz
dspic30f4013.menu.fcpu.16000000.build.nb_fcpu=16000000
dspic30f4013.menu.fcpu.20000000=20 MHz
dspic30f4013.menu.fcpu.20000000.build.nb_fcpu=20000000
dspic30f4013.menu.fcpu.22118400=22.1184 MHz
dspic30f4013.menu.fcpu.22118400.build.nb_fcpu=22118400
dspic30f4013.menu.fcpu.24000000=24 MHz
dspic30f4013.menu.fcpu.24000000.build.nb_fcpu=24000000
